<font size="8"> Introduction to Pandas </font>


<font size="5"> Import libraries </font>

In [1]:
import numpy as np
import pandas as pd

<font size="5"> Initializing instances in Pandas </font>

In [2]:
df = pd.DataFrame({'Name': ['Elaine', 'Josh', 'Lin', 'Naho', 'Steve', 'Charles'],
                   'Age': [44, 17, 64, 33, 45, 25],
                   'Salary': [7000, 5800, 7900, 5600, 6700, 5900],
                   'Group': ['MA', 'NW', 'NM', 'WA', 'PA', 'TX']})
df

      Name  Age  Salary Group
0   Elaine   44    7000    MA
1     Josh   17    5800    NW
2      Lin   64    7900    NM
3     Naho   33    5600    WA
4    Steve   45    6700    PA
5  Charles   25    5900    TX


<font size="5"> Overview of the dataframe </font>

In [3]:
# check top rows
print(df.head())

     Name  Age  Salary Group
0  Elaine   44    7000    MA
1    Josh   17    5800    NW
2     Lin   64    7900    NM
3    Naho   33    5600    WA
4   Steve   45    6700    PA

In [4]:
# check bottom rows
print(df.tail(3))

      Name  Age  Salary Group
3     Naho   33    5600    WA
4    Steve   45    6700    PA
5  Charles   25    5900    TX

In [5]:
# check index
print(df.index)

RangeIndex(start=0, stop=6, step=1)

In [6]:
# check attribute names
print(df.columns)

Index(['Name', 'Age', 'Salary', 'Group'], dtype='object')

In [7]:
# check sum 
print(df.sum())

Name      ElaineJoshLinNahoSteveCharles
Age                                 228
Salary                            38900
Group                      MANWNMWAPATX
dtype: object

In [8]:
# check mean
print(df.mean())

Age         38.000000
Salary    6483.333333
dtype: float64

<font size="5"> Basic operations </font>

In [9]:
# Taking subsets of columns
print(df['Age'])

0    44
1    17
2    64
3    33
4    45
5    25
Name: Age, dtype: int64

In [10]:
# Selecting rows with index
print(df[2:4])

   Name  Age  Salary Group
2   Lin   64    7900    NM
3  Naho   33    5600    WA

In [11]:
# Selecting rows and columns together with value
print(df.loc[1:4, ['Salary','Name']])

   Salary   Name
1    5800   Josh
2    7900    Lin
3    5600   Naho
4    6700  Steve

In [12]:
# Selecting rows and columns together with index
print(df.iloc[1:4, 2:4])

   Salary Group
1    5800    NW
2    7900    NM
3    5600    WA

In [13]:
# Selecting rows and columns together with index
print(df.iloc[[1,3,4], [1,3]])

   Age Group
1   17    NW
3   33    WA
4   45    PA

In [14]:
# Selecting with query
print(df[df['Salary']>100])

      Name  Age  Salary Group
0   Elaine   44    7000    MA
1     Josh   17    5800    NW
2      Lin   64    7900    NM
3     Naho   33    5600    WA
4    Steve   45    6700    PA
5  Charles   25    5900    TX

In [15]:
# Selecting with multiple queries
print(df[(df['Salary']>100) & (df['Age']>30)])

     Name  Age  Salary Group
0  Elaine   44    7000    MA
2     Lin   64    7900    NM
3    Naho   33    5600    WA
4   Steve   45    6700    PA

In [16]:
# sort according to specific attribute
print(df.sort_values(by='Age', ascending=False))

      Name  Age  Salary Group
2      Lin   64    7900    NM
4    Steve   45    6700    PA
0   Elaine   44    7000    MA
3     Naho   33    5600    WA
5  Charles   25    5900    TX
1     Josh   17    5800    NW

In [17]:
# appending another DataFrame to the old one
df2 = pd.DataFrame({'Name': ['Chris', 'Peter'],
                   'Age': [18, np.nan],
                   'Salary': [np.nan, 9],
                   'Group': ['NV', 'FL']})

df_new = df.append(df2, ignore_index=True)
df_new

      Name   Age  Salary Group
0   Elaine  44.0  7000.0    MA
1     Josh  17.0  5800.0    NW
2      Lin  64.0  7900.0    NM
3     Naho  33.0  5600.0    WA
4    Steve  45.0  6700.0    PA
5  Charles  25.0  5900.0    TX
6    Chris  18.0     NaN    NV
7    Peter   NaN     9.0    FL

In [18]:
# appending another DataFrame to the old one
df3 = pd.DataFrame({'Name': ['Chr', 'Pet'],
                   'Age': [18, np.nan],
                   'Salary': [np.nan, 9],
                   'Group': ['NV', 'FL']})

df_new = df.append(df3,  ignore_index= False)
df_new

      Name   Age  Salary Group
0   Elaine  44.0  7000.0    MA
1     Josh  17.0  5800.0    NW
2      Lin  64.0  7900.0    NM
3     Naho  33.0  5600.0    WA
4    Steve  45.0  6700.0    PA
5  Charles  25.0  5900.0    TX
0      Chr  18.0     NaN    NV
1      Pet   NaN     9.0    FL

In [19]:
# filter out NaN values
print(df_new.dropna(how='any', subset=['Salary']))

      Name   Age  Salary Group
0   Elaine  44.0  7000.0    MA
1     Josh  17.0  5800.0    NW
2      Lin  64.0  7900.0    NM
3     Naho  33.0  5600.0    WA
4    Steve  45.0  6700.0    PA
5  Charles  25.0  5900.0    TX
1      Pet   NaN     9.0    FL

In [20]:
# replace NaN values with specified value
print(df_new.fillna(value='None'))

      Name   Age Salary Group
0   Elaine    44   7000    MA
1     Josh    17   5800    NW
2      Lin    64   7900    NM
3     Naho    33   5600    WA
4    Steve    45   6700    PA
5  Charles    25   5900    TX
0      Chr    18   None    NV
1      Pet  None      9    FL

In [21]:
# export as numpy array
print(df_new.values)

[['Elaine' 44.0 7000.0 'MA']
 ['Josh' 17.0 5800.0 'NW']
 ['Lin' 64.0 7900.0 'NM']
 ['Naho' 33.0 5600.0 'WA']
 ['Steve' 45.0 6700.0 'PA']
 ['Charles' 25.0 5900.0 'TX']
 ['Chr' 18.0 nan 'NV']
 ['Pet' nan 9.0 'FL']]

In [22]:
df_left = pd.DataFrame({'Name': ['Elaine', 'Josh', 'Lin', 'Naho', 'Steve', 'Charles'],
                   'Age': [44, 17, 64, 33, 45, 25],
                   'Salary': [7000, 5800, 7900, 5600, 6700, 5900],
                   'Group': ['MA', 'NW', 'NM', 'WA', 'PA', 'TX']})
df_right = pd.DataFrame({'Name': ['Josh', 'Lin', 'Steve', 'Charles', 'Chris', 'Pan'],
                   'Location': ["Boston", "DC", "Seattle", "San Jose", "New York", "Denver"],
                   'Team': ["A", "A", "C", "B", "D", "C"]})

print(df_left)
print(df_right)

      Name  Age  Salary Group
0   Elaine   44    7000    MA
1     Josh   17    5800    NW
2      Lin   64    7900    NM
3     Naho   33    5600    WA
4    Steve   45    6700    PA
5  Charles   25    5900    TX
      Name  Location Team
0     Josh    Boston    A
1      Lin        DC    A
2    Steve   Seattle    C
3  Charles  San Jose    B
4    Chris  New York    D
5      Pan    Denver    C

In [23]:
# Merging two tables using intersection of keys from both frames
pd.merge(df_left, df_right,how="inner")

      Name  Age  Salary Group  Location Team
0     Josh   17    5800    NW    Boston    A
1      Lin   64    7900    NM        DC    A
2    Steve   45    6700    PA   Seattle    C
3  Charles   25    5900    TX  San Jose    B

In [24]:
# Merging two tables using union of keys from both frames
pd.merge(df_left, df_right,how="outer")

      Name   Age  Salary Group  Location Team
0   Elaine  44.0  7000.0    MA       NaN  NaN
1     Josh  17.0  5800.0    NW    Boston    A
2      Lin  64.0  7900.0    NM        DC    A
3     Naho  33.0  5600.0    WA       NaN  NaN
4    Steve  45.0  6700.0    PA   Seattle    C
5  Charles  25.0  5900.0    TX  San Jose    B
6    Chris   NaN     NaN   NaN  New York    D
7      Pan   NaN     NaN   NaN    Denver    C

In [25]:
# Merging two tables using keys from left frame only
pd.merge(df_left, df_right,how="left")

      Name  Age  Salary Group  Location Team
0   Elaine   44    7000    MA       NaN  NaN
1     Josh   17    5800    NW    Boston    A
2      Lin   64    7900    NM        DC    A
3     Naho   33    5600    WA       NaN  NaN
4    Steve   45    6700    PA   Seattle    C
5  Charles   25    5900    TX  San Jose    B

In [26]:
# Merging two tables using keys from right frame only
pd.merge(df_left, df_right,how="right")

      Name   Age  Salary Group  Location Team
0     Josh  17.0  5800.0    NW    Boston    A
1      Lin  64.0  7900.0    NM        DC    A
2    Steve  45.0  6700.0    PA   Seattle    C
3  Charles  25.0  5900.0    TX  San Jose    B
4    Chris   NaN     NaN   NaN  New York    D
5      Pan   NaN     NaN   NaN    Denver    C

In [27]:
# Group frame with specified column and get the mean values for each "cluster"
(pd.merge(df_left, df_right,how="outer").groupby(["Team"]).mean())

       Age  Salary
Team
A     40.5  6850.0
B     25.0  5900.0
C     45.0  6700.0
D      NaN     NaN

In [28]:
# Visualize 
df_left.plot(x="Name", y=["Age","Salary"], kind='bar');

<font size="5"> Challenge </font>

Implement a function process() that given the path to a CSV file as input, select those entries with a valid license (not NaN), room type of Private room, price less than or equal to 80, minimum nights less than or equal to 2, number of reviewers more than or equal to 500, or those with a valid license (not NaN), a room type of Entire home/apt, price less than or equal to 100, minimum nights less than or equal to 1, number of reviewers more than or equal to 100, and finally present the result sorted according to latitude and then longitude in an ascending order and with only columns of id, latitude, longitude, room_type, price and availability_365.

In [29]:
def process(path):
    
    pass
    
df = process('listings.csv')
print(df)

None